ra-rs/ra/svd/vendor/R7FA6E2BB.svd
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFFDSTS%s</name>
                    <description>RX FIFO Access CANFD Status Register %s</description>
                    <addressOffset>0x0528</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFESI</name>
                            <description>Error State Indicator bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CANFD frame received from error active node</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CANFD frame received from error passive node</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RFBRS</name>
                            <description>Bit Rate Switch bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CANFD frame received with no bit rate switch</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CANFD frame received with bit rate switch</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RFFDF</name>
                            <description>CAN FD Format bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non CANFD frame received</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CANFD frame received</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RFIFL</name>
                            <description>RX FIFO Buffer Information Label Field</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CFDRFPTR</name>
                            <description>RX FIFO Buffer Pointer Field</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFDF%s_0</name>
                    <description>RX FIFO Access Data Field 0 Register %s</description>
                    <addressOffset>0x052C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFDF%s_1</name>
                    <description>RX FIFO Access Data Field 1 Register %s</description>
                    <addressOffset>0x0530</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFDF%s_2</name>
                    <description>RX FIFO Access Data Field 2 Register %s</description>
                    <addressOffset>0x0534</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFDF%s_3</name>
                    <description>RX FIFO Access Data Field 3 Register %s</description>
                    <addressOffset>0x0538</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFDF%s_4</name>
                    <description>RX FIFO Access Data Field 4 Register %s</description>
                    <addressOffset>0x053C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFDF%s_5</name>
                    <description>RX FIFO Access Data Field 5 Register %s</description>
                    <addressOffset>0x0540</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFDF%s_6</name>
                    <description>RX FIFO Access Data Field 6 Register %s</description>
                    <addressOffset>0x0544</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFDF%s_7</name>
                    <description>RX FIFO Access Data Field 7 Register %s</description>
                    <addressOffset>0x0548</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFDF%s_8</name>
                    <description>RX FIFO Access Data Field 8 Register %s</description>
                    <addressOffset>0x054C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
